#+PROPERTY: header-args:R  :session *R-emp* :tangle yes :eval yes

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../../css/readtheorg.css" />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../../css/htmlize.css" />

#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,11pt]
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{setspace}
#+LATEX_HEADER: \onehalfspacing
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{amsthm}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{mathtools}
#+LATEX_HEADER: \usepackage{hyperref}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \hypersetup{colorlinks,citecolor=black,filecolor=black,linkcolor=black,urlcolor=black}


Now we can show how to use R to do some statistical
analysis. This demonstration answers the questions of Empirical
Exercise 3.1 at the end
of Chapter 3. Furthermore, we carry out this exercise in the format of
*reproducible research*. That means, we should accomplish they
following tasks in answering the problem:
1) using R to compute the statistics
   asked in the questions
2) including R code and the results of running the code in the answer, and
3) describing our work and answers in plain language along with code
   and numerical answers.


*** Read the data

The first thing first is of course read the data correctly from the
Stata file [[file:data/cps92_08.dta]], which can be read by the function
=read.dta()= in the package of =foreign=.

#+NAME: read-data
#+BEGIN_SRC R :exports both :results output
  library(foreign)
  cpsdat <- read.dta("data/cps92_08.dta")
  head(cpsdat)
#+END_SRC

#+RESULTS[78ad41328e0d0145deb64876ca1444c47e0bc300]: read-data
:   year       ahe bachelor female age
: 1 1992 11.188811        1      0  29
: 2 1992 10.000000        1      0  33
: 3 1992  5.769231        0      0  30
: 4 1992  1.562500        0      0  32
: 5 1992 14.957265        1      0  31
: 6 1992  8.660096        1      1  26

*** Calculate the sample means of average hourly earnings in 1992 and 2008

There are many ways to compute the sample means in 1992 and 2008,
respectively. First, to make you more familiar with the  R
language, we compute them in a very basic way. Then, we show how to
get the same results with some powerful functions.

#+BEGIN_SRC R :exports both :results output
  # extract the data for average hourly earnings in 1992 and 2008
  ahe.92 <- cpsdat$ahe[cpsdat$year == 1992]
  ahe.08 <- cpsdat$ahe[cpsdat$year == 2008]
  mean.ahe.92 <- mean(ahe.92); mean.ahe.92
  mean.ahe.08 <- mean(ahe.08); mean.ahe.08
#+END_SRC

#+RESULTS[8885fe7066017107c646da902bf990f017b02cd3]:
: [1] 11.62637
: [1] 18.97609

The average hourly earnings are src_R{round(mean.ahe.92, 2)} dollars
in 1992 and src_R{round(mean.ahe.08, 2)} dollars in 2008.

*** Alternative methods to calculate the sample means and confidence intervals

In the above example, to compute the sample averages in 1992 and 2008,
we write code separately for each year, which can be done more easily
in R.

We can compute the averages for each year using the function
=aggregate()=, which splits the whole data base into two parts by the
values of =year=. Then, for each part we compute the average by
specifying the argument =FUN= to be =mean=, i.e., specifying the
function to be used for each part as the =mean()= function. Also, in
this case, we use =~= to specify a *formula* that means that we split
=ahe= by =year=.

#+BEGIN_SRC R :exports both :results output
  # Use aggregate() to compute the means in both years
  ahe.means <- aggregate(ahe ~ year, FUN = mean, data = cpsdat)
  ahe.means
#+END_SRC

#+RESULTS[1d26776687726519ee92a5d12bfec8a148b24269]:
:   year      ahe
: 1 1992 11.62637
: 2 2008 18.97609

The confidence interval can be extracted from the results of the
=t.test()= function, which is a list.
#+BEGIN_SRC R :exports both :results output
  # t test for ahe in 1992
  t.ahe.92 <- t.test(ahe.92); t.ahe.92$conf.int
  # t test for ahe in 2008
  t.ahe.08 <- t.test(ahe.08); t.ahe.08$conf.int
  # test for the change between 1992 and 2008
  t.ahe.diff <- t.test(ahe.08, ahe.92); t.ahe.diff
#+END_SRC

#+RESULTS[6136cb6847bcee57c66019495d0d5cc8dc68f9de]:
#+begin_example
[1] 11.50019 11.75254
attr(,"conf.level")
[1] 0.95
[1] 18.74975 19.20244
attr(,"conf.level")
[1] 0.95

	Welch Two Sample t-test

data:  ahe.08 and ahe.92
t = 55.597, df = 12065, p-value < 2.2e-16
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 7.090601 7.608853
sample estimates:
mean of x mean of y
 18.97609  11.62637
#+end_example

The confidence interval of the change in average hourly earnings
between 1992 and 2008 is (src_R{round(t.ahe.diff$conf.int[1], 2)},
src_R{round(t.ahe.diff$conf.int[2], 2)}).

** COMMENT Question (f)

To answer this question, we need to compare the following pairs:
- =ahe.high.92= v.s. =ahe.high.08=: compute the average of the gap,
  and the 95% confidence interval of the gap;
- =ahe.bach.92= v.s. =ahe.bach.08=: compute the average of the gap,
  and the 95% confidence interval of the gap;
- =ahe.bach.08 - ahe.high.08= v.s. =ahe.bach.92 - ahe.high.92=:
  compute the average of the gap, and the 95% confidence interval.

However, there is a problem in such comparison. Namely, the length of
=ahe.high.92= and =ahe.high.08= are not the same. So are =ahe.bach.92=
and =ahe.bach.08=.

#+BEGIN_SRC R :exports both :results output
  # High school earnings increase
  change.ahe.high <- ahe.high.08 - ahe.high.92
  length(ahe.high.08)
  length(ahe.high.92)
#+END_SRC

#+RESULTS:
: Warning message:
: In ahe.high.08 - ahe.high.92 :
:   longer object length is not a multiple of shorter object length
: [1] 4002
: [1] 4643

To circumvent this problem, we can select a subset the samples in 1992
and 2008 so that the length of data in each year is the same. Let's
randomly draw 1000 of samples from each year, and compute the gap in
earnings of high school graduates between the 2008 and 1992.

#+BEGIN_SRC R :exports code
  # Draw random samples from 1992 and 2008

  nsmp.high.92 <- sample.int(length(ahe.high.92), 1000, replace = TRUE)
  nsmp.high.08 <- sample.int(length(ahe.high.08), 1000, replace = TRUE)

  ahe.high.08.smp <- ahe.high.08[nsmp.high.08]
  ahe.high.92.smp <- ahe.high.92[nsmp.high.92]

  gap.high.0892 <- ahe.high.08.smp - ahe.high.92.smp
#+END_SRC

#+RESULTS:

With these random samples, we can compute the mean and the confidence
interval.

#+BEGIN_SRC R :exports code :results output
  mean.gap.high.0892 <- mean(gap.high.0892)
  t.gap.high.0892 <- t.test(gap.high.0892)
  ci.gap.high.0892 <- t.gap.high.0892$conf.int
#+END_SRC

#+RESULTS:

The story does not end here. How come we trust the results from one
set of random samples of the data? To alleviate the doubt, we can
randomly choose another 1000 random samples and calculate the mean and
confidence interval, and do it again for another set of 1000 random
samples, and repeat the same steps for thousands of times. That is, we
do an iteration of the same procedure comprising random sampling and
computing the mean and the confidence interval in each step.

In R, we can do a =for= loop or a =while= loop. In this case, let's
start with a =for= loop.

#+BEGIN_SRC R :exports code :results output
  niter <- 9999
  mean.gap.high <- NULL
  ci.gap.high <- NULL

  for (i in 1:niter) {

      nsmp.high.92 <- sample.int(length(ahe.high.92), 1000, replace = TRUE)
      nsmp.high.08 <- sample.int(length(ahe.high.08), 1000, replace = TRUE)

      ahe.high.08.smp <- ahe.high.08[nsmp.high.08]
      ahe.high.92.smp <- ahe.high.92[nsmp.high.92]

      gap.high.0892 <- ahe.high.08.smp - ahe.high.92.smp

      mean.gap.high.0892 <- mean(gap.high.0892)
      t.gap.high.0892 <- t.test(gap.high.0892)
      ci.gap.high.0892 <- t.gap.high.0892$conf.int

      mean.gap.high <- c(mean.gap.high, mean.gap.high.0892)
      ci.gap.high <- rbind(ci.gap.high, ci.gap.high.0892)
  }

  mean.gap.high.smp <- mean(mean.gap.high)
  ci.gap.high.smp <- apply(ci.gap.high, MARGIN = 2, FUN = mean)
#+END_SRC

#+RESULTS:

- The mean of the gap in earnings of high school graduates between
  1992 and 2008 is src_R{round(mean.gap.high.smp, 2)} dollars.
- The confidence interval of the gap is
  (src_R{paste0(round(ci.gap.high.smp, 2), collapse = ", ")}).
